## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                            |
|--------|------------------------------------------------------------|
| add    | `aws_iam_policy.saas_procurement_ecs_exec`                 |
|        | `aws_iam_role_policy_attachment.saas_procurement_ecs_exec` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.saas_procurement_ecs_exec will be created
  + resource "aws_iam_policy" "saas_procurement_ecs_exec" {
      + arn         = (known after apply)
      + description = "Allow connection to the ecs task running the container"
      + id          = (known after apply)
      + name        = "saas_procurement_ecs_exec"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowECSExec"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.saas_procurement_ecs_exec will be created
  + resource "aws_iam_role_policy_attachment" "saas_procurement_ecs_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "saas_procurement-task-role"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.saas_procurement_ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.saas_procurement_task"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
